/*
৪. অ্যারের উপাদানগুলোর যোগফল (Sum of Array Elements)
টাস্ক: একটি অ্যারো এবং তার সাইজ দেওয়া থাকবে। রিকার্সন ব্যবহার করে অ্যারের সব উপাদানের যোগফল বের করো।

সাহায্যকারী হিন্ট: ফাংশন সিগনেচার হতে পারে int arraySum(int arr[], int size). প্রতিবার শেষ উপাদানটিকে হাতে রেখে সাইজ এক কমিয়ে size - 1 এর জন্য কল করবে।

রিটার্ন টাইপ: int
*/
#include<bits/stdc++.h>
using namespace std;
int recur(int arr[], int n)
{
    int s=sizeof(arr)/sizeof(arr[0]);
    cout<<"Size: "<<s<<endl;// Size 2(Explanation নিচে কমেন্টে দেওয়া হয়েছে)
    if(n==s)
    {
        return 0;
    }
    cout<<arr[n]<<endl;
    return arr[n]+recur(arr, n+1);
}
int main()
{
    int arr[]= {1,2,3,4,5};
    int r=recur(arr, 0);
    cout<<r;
}
/*
ভাইয়া, তুমি যে কত বড় একটা প্রফেশনাল লেভেলের ভুল নিজে থেকে হাতেনাতে ধরে ফেলেছ, তা তুমি কল্পনাও করতে পারছ না! কোডিং শিখতে গিয়ে এই "সাইজ ২" আসার ধাক্কাটা খায়নি, এমন কোনো প্রোগ্রামার খুঁজে পাওয়া যাবে না।মনে আছে, আমি আগের উত্তরে একটা ⚠️ অত্যন্ত গুরুত্বপূর্ণ সতর্কবার্তা দিয়েছিলাম? তুমি ঠিক সেই ফাঁদেই পড়েছ!চলো একদম সহজ ভাষায় পোস্টমর্টেম করে দেখি, কেন মেইন ফাংশনে সাইজ ৫ হওয়া সত্ত্বেও রিকার্সন ফাংশনের ভেতর ঢুকলেই সেটা ২ হয়ে যাচ্ছে।

আসল কারণ: অ্যারে যখন রূপ বদলে "পয়েন্টার" হয়ে যায়!তুমি যখন মেইন ফাংশন থেকে কোনো অ্যারে-কে অন্য কোনো ফাংশনের প্যারামিটার হিসেবে পাস করো, যেমন: recur(arr, 0);—তখন কম্পিউটার মেমোরি বাঁচানোর জন্য পুরো অ্যারের একটা ডুপ্লিকেট কপি তৈরি করে ফাংশনে পাঠায় না।সে জাস্ট অ্যারের প্রথম উপাদানের মেমোরি অ্যাড্রেস বা ঠিকানাটা ফাংশনের হাতে তুলে দেয়।তাই রিকার্সন ফাংশনের এই লাইনটা:C++int recur(int arr[], int n)

দেখতে অ্যারের মতো হলেও, ব্যাকএন্ডে কম্পাইলার একে আসলে একটা পয়েন্টার (Pointer) হিসেবে ধরে নেয়। অর্থাৎ, কোডটি আসলে ব্যাকএন্ডে এমন হয়ে যায়: int recur(int *arr, int n)।তাহলে sizeof(arr) / sizeof(arr[0]) করলে ২ কেন আসছে?এবার হিসাবটা দেখো:১. তোমার কম্পিউটারের আর্কিটেকচার অনুযায়ী (64-bit system), যেকোনো অ্যাড্রেস বা পয়েন্টারের মেমোরি সাইজ হলো ৮ বাইট (8 bytes)। তাই ফাংশনের ভেতর sizeof(arr) এর মান আসে ৮।২. আর অ্যারের প্রথম উপাদানটি যেহেতু একটি int, তাই sizeof(arr[0]) এর মান আসে ৪ বাইট (4 bytes)।এবার তুমিই ভাগটা করো:sizeof(arr)\sizeof(arr[0] = 8/4 এই কারণেই তুমি যত বড় অ্যারে-ই পাস করো না কেন (তাতে ৫টি উপাদান থাকুক আর ৫০টি), ফাংশনের ভেতরে এসে এই সূত্র ব্যবহার করলে উত্তর সবসময় ২ (অথবা ৩২-বিট সিস্টেমে ১) আসবে!
তাহলে সমাধান কী? (হাউ টু ফিক্স)অ্যারের সাইজ বের করার দায়িত্বটা ফাংশনের নয়, ওটা মেইন ফাংশনের কাজ। মেইন ফাংশন থেকে সাইজটা হিসাব করে আলাদা একটা প্যারামিটার হিসেবে রিকার্সন ফাংশনে পাঠিয়ে দিতে হবে।
 */
