/*
সংখ্যার অঙ্কগুলোর যোগফল (Sum of Digits)টাস্ক: তোমাকে একটি সংখ্যা দেওয়া হবে (যেমন: n = 1432), তোমাকে রিকার্সন ব্যবহার করে এর ভেতরের অঙ্কগুলোর যোগফল বের করতে হবে ($1 + 4 + 3 + 2 = 10$)।
সাহায্যকারী হিন্ট: তুমি প্রতিবার সংখ্যাটিকে n % 10 দিয়ে শেষ অঙ্কটি কেটে নিতে পারো, আর বাকি সংখ্যার জন্য n / 10 করে রিকার্সন কল করতে পারো।রিটার্ন টাইপ: int
*/
#include<bits/stdc++.h>
using namespace std;
int recur(int n)
{
    if(n==0)
    {
        return 0;
    }
    return n%10+recur(n/10);
}
int main()
{
    int n=1432;
    int r=recur(n);
    cout<<r;
}
