/*
২. স্ট্রিং উল্টানো (Reverse a String)
টাস্ক: তোমাকে একটি স্ট্রিং দেওয়া হবে (যেমন: "hello"), তোমাকে রিকার্সন ব্যবহার করে স্ক্রিনে সেটিকে উল্টো করে প্রিন্ট করতে হবে ("olleh")। তুমি কোনো লুপ বা এক্সট্রা স্ট্রিং ভ্যারিয়েবল ব্যবহার করতে পারবে না।

সাহায্যকারী হিন্ট: মনে আছে তো? লিঙ্কড লিস্টের উল্টো প্রিন্ট বা ১ থেকে ৫ প্রিন্টের মতো—আগে পরের ক্যারেক্টারকে ডাকবে, ফিরতি পথে নিজের ক্যারেক্টার প্রিন্ট করবে!

রিটার্ন টাইপ: void
*/
#include<bits/stdc++.h>
using namespace std;
void recur(string text, int n){
   if(n<0){
    return;
   }
    cout<<text[n];
   recur(text, n-1);

}
int main(){
string text="hello";
recur(text,text.length()-1);
}
