/*
৫. কাউন্ট ডাউন এবং আপ (The Double Sequence)
টাস্ক: তোমাকে একটি সংখ্যা দেওয়া হবে n = 3। তোমাকে রিকার্সন ব্যবহার করে স্ক্রিনে ঠিক এই সিকোয়েন্সটি প্রিন্ট করতে হবে: 3 2 1 1 2 3.

সাহায্যকারী হিন্ট: খুব মজার প্রবলেম! এখানে ফাংশন কলের আগেও একবার প্রিন্ট করতে হবে (যাওয়ার পথে প্রিন্ট), আবার ফাংশন কলের পরেও একবার প্রিন্ট করতে হবে (ফিরতি পথে প্রিন্ট)।

রিটার্ন টাই
*/
#include<bits/stdc++.h>
using namespace std;
void recur(int n){
if(n==0){
    return;
}
cout<<n<<" ";
recur(n-1);
cout<<n<<" ";
}
int main(){
    recur(3);
}
